21-rails-crud/scary-movies/app/controllers/scary_movies_controller.rb

  def index
    @scary_movies = ScaryMovie.all
---
SELECT "scary_movies".* FROM "scary_movies"

  def create
    @scary_movie = ScaryMovie.new(params)
    if @scary_movie.save
---
INSERT INTO "scary_movies" ("title", "scariness_rating", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "The Thing"], ["scariness_rating", 6], ["created_at", "2020-10-15 19:48:23.834179"], ["updated_at", "2020-10-15 19:48:23.834179"]]

  def find_movie
    @scary_movie = ScaryMovie.find_by(id: params[:id])
---
SELECT "scary_movies".* FROM "scary_movies" WHERE "scary_movies"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]