20-rails-models-and-restful-routes/scary-movies/app/controllers/scary_movies_controller.rb

SELECT "scary_movies".* FROM "scary_movies"
---
  def index
    @scary_movies = ScaryMovie.all

SELECT "scary_movies".* FROM "scary_movies" WHERE "scary_movies"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def show
    @scary_movie = ScaryMovie.find_by(id: params[:id])